org/_thoughts/2019-01-01-tex-test.org
#+BEGIN_EXPORT html
---
layout: default
title: Syntax Highlighting???
math: true
---
#+END_EXPORT



..

* Mathjax
I want to render LaTeX with MathJax.

$$\alpha := \beta \cdot \delta^{x^e}$$

Will I get an error... $$\aalphaaa := 55$$

What about single cash delims?
$mx + b = y$

And classic [ ] delims
\[(e^2 \cdot 33) := 5 - \alpha\]

Begin and end tags
\begin
\beta \cdot 5 := 99
\end
* code blocks
#+begin_src python
  import numpy as np

  data = np.array([[1,2,3],[2,2,2]])

  def foo(apple: str) -> bool:
      x = 9
      for i in range(5):
          print(x)
          x -= 1
      return apple == 33

  class baz:
      def __init__(self, a, b, c):
          pass
#+end_src

Emacs  lisp!
#+begin_src emacs-lisp
(setq apple 33)
#+end_src

JS
#+begin_src js
  let a = 4
  let d12 = 'app'

  for (bird of birds) {
      console.log(bird)
  }
#+end_src


#+BEGIN_EXPORT html
 <details>
  <summary>Epcot Center</summary>
  <p>Epcot is a theme park at Walt Disney World Resort featuring exciting attractions, international pavilions, award-winning fireworks and seasonal special events.</p>
</details> 
#+END_EXPORT


#+BEGIN_EXPORT html
 <details>
<summary>Does it work?</summary>
<p>
#+END_EXPORT

#+begin_src python
  import torch.nn as nn

  def foo(apple, banana):
      print(apple + 's')
      return 33
#+end_src

#+BEGIN_EXPORT html
</p>
</details> 
#+END_EXPORT

