jekyll/_thoughts/2019-01-01-tex-test.html
---
layout: post
title: Syntax Highlighting???
math: true
date: 2020-10-10
---

<div id="outline-container-orgbafba88" class="outline-2">
<h2 id="orgbafba88">Mathjax</h2>
<div class="outline-text-2" id="text-orgbafba88">
<p>
I want to render LaTeX with MathJax.
</p>

<p>
\[\alpha := \beta \cdot \delta^{x^e}\]
</p>

<p>
Will I get an error&#x2026; \[\aalphaaa := 55\]
</p>

<p>
What about single cash delims?
\(mx + b = y\)
</p>

<p>
And classic [ ] delims
\[(e^2 \cdot 33) := 5 - \alpha\]
</p>

<p>
Begin and end tags
\begin
&beta; &sdot; 5 := 99
\end
</p>
</div>
</div>
<div id="outline-container-org2ee26b9" class="outline-2">
<h2 id="org2ee26b9">code blocks</h2>
<div class="outline-text-2" id="text-org2ee26b9">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np

<span class="org-variable-name">data</span> = np.array([[1,2,3],[2,2,2]])

<span class="org-keyword">def</span> <span class="org-function-name">foo</span>(apple: <span class="org-builtin">str</span>) -&gt; <span class="org-builtin">bool</span>:
    <span class="org-variable-name">x</span> = 9
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(5):
        <span class="org-keyword">print</span>(x)
        <span class="org-variable-name">x</span> -= 1
    <span class="org-keyword">return</span> apple == 33

<span class="org-keyword">class</span> <span class="org-type">baz</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, a, b, c):
        <span class="org-keyword">pass</span>
</pre>
</div>

<p>
Emacs  lisp!
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> apple 33)
</pre>
</div>

<p>
JS
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">let</span> <span class="org-variable-name">a</span> = 4
<span class="org-keyword">let</span> <span class="org-variable-name">d12</span> = <span class="org-string">'app'</span>

<span class="org-keyword">for</span> (bird of birds) {
    console.log(bird)
}
</pre>
</div>


 <details>
  <summary>Epcot Center</summary>
  <p>Epcot is a theme park at Walt Disney World Resort featuring exciting attractions, international pavilions, award-winning fireworks and seasonal special events.</p>
</details> 


 <details>
<summary>Does it work?</summary>
<p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch.nn <span class="org-keyword">as</span> nn

<span class="org-keyword">def</span> <span class="org-function-name">foo</span>(apple, banana):
    <span class="org-keyword">print</span>(apple + <span class="org-string">'s'</span>)
    <span class="org-keyword">return</span> 33
</pre>
</div>

</p>
</details> 
</div>
</div>
